class config:#設定用クラス
    longmather = False #最後の文字が長音だった場合,False:無視する,True:母音とする
    smallbig = True #最後の文字が拗音・促音だった場合,False:無視する,True:清音とする
    dullhalf = False #最後の文字が濁音・半濁音だった場合,False:そのまま,True:とってもよい

def lastcha(self,longm=config.longmather,small=config.smallbig,dullh=config.dullhalf):#単語の最後の文字
    if self == "":
        raise ValueError("\"Null\"")
    if self[-1] == "ー":
        if len(self) == 1:
            raise ValueError("長音\"ー\"")
        if longm:
            mathe = {
                "ァ":"ア","ア":"ア","ィ":"イ","イ":"イ","ゥ":"ウ","ウ":"ウ","ェ":"エ","エ":"エ","ォ":"オ","オ":"オ",
                "カ":"ア","ガ":"ア","キ":"イ","ギ":"イ","ク":"ウ","グ":"ウ","ケ":"エ","ゲ":"エ","コ":"オ","ゴ":"オ",
                "サ":"ア","ザ":"ア","シ":"イ","ジ":"イ","ス":"ウ","ズ":"ウ","セ":"エ","ゼ":"エ","ソ":"オ","ゾ":"オ",
                "タ":"ア","ダ":"ア","チ":"イ","ヂ":"イ","ッ":"ウ","ツ":"ウ","ヅ":"ウ","テ":"エ","デ":"エ","ト":"オ","ド":"オ",
                "ナ":"ア","ニ":"イ","ヌ":"ウ","ネ":"エ","ノ":"オ",
                "ハ":"ア","バ":"ア","パ":"ア","ヒ":"イ","ビ":"イ","ピ":"イ","フ":"ウ","ブ":"ウ","プ":"ウ",
                "ヘ":"エ","ベ":"エ","ペ":"エ","ホ":"オ","ボ":"オ","ポ":"オ",
                "マ":"ア","ミ":"イ","ム":"ウ","メ":"エ","モ":"オ",
                "ャ":"ア","ヤ":"ア","ュ":"ウ","ユ":"ウ","ョ":"オ","ヨ":"オ",
                "ラ":"ア","リ":"イ","ル":"ウ","レ":"エ","ロ":"オ",
                "ヮ":"ア","ワ":"ア","ヰ":"イ","ヱ":"エ","ヲ":"オ","ン":"ン",
                "ヴ":"ウ","ヵ":"ア","ヶ":"エ","ヷ":"ア","ヸ":"イ","ヹ":"エ","ヺ":"オ",}
            if self[-2] in mathe:
                return mathe[self[-2]]
            else:
                raise ValueError("\""+self[-2]+"\"")
        else:
            return lastcha(self[:-1],longm,small,dullh)
    
    sma = {
        "ャ":"ヤ","ュ":"ユ","ョ":"ヨ","ッ":"ツ",
        "ァ":"ア","ィ":"イ","ゥ":"ウ","ェ":"エ","ォ":"オ",
        "ヮ":"ワ","ヶ":"ケ","ヵ":"カ"}
    if self[-1] in list(sma.keys()):
        if len(self) == 1:
            raise ValueError("\""+self[-1]+"\"")
        if small:
            return sma[self[-1]]
        else:
            return lastcha(self[:-1],longm,small,dullh)
    
    if dullh:
        dull = {
            "ガ":"カ","ギ":"キ","グ":"ク","ゲ":"ケ","ゴ":"コ",
            "ザ":"サ","ジ":"シ","ズ":"ス","ゼ":"セ","ゾ":"ソ",
            "ダ":"タ","ヂ":"チ","ヅ":"ツ","デ":"テ","ド":"ト",
            "バ":"ハ","ビ":"ヒ","ブ":"フ","ベ":"ヘ","ボ":"ホ",
            "パ":"ハ","ピ":"ヒ","プ":"フ","ペ":"ヘ","ポ":"ホ",
            "ヴ":"ウ","ヷ":"ワ","ヸ":"ヰ","ヹ":"ヱ","ヺ":"ヲ",}
        if self[-1] in dull:
            return dull[self[-1]]
        else:
            return self[-1]
    else:
        return self[-1]

def txt2list(path):#.txtから辞書にする。
    out = {}
    with open(path,mode="r",encoding="utf-8") as f:
        for i in f:
            out[i.strip()] = 0
    return out

